In [2]:
import pandas as pd
# 데이터 읽어서 데이터 프레임(titles) 만들기
titles = pd.read_csv("c:/sjjang/workspace/titles.csv")

In [37]:
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [38]:
titles.tail(3)

               title  year
215978         E yue  2005
215979  Lakota Girls  2015
215980  The Sting II  1983

In [20]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
title    215981 non-null object
year     215981 non-null int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [44]:
titles.isnull().sum()

title    0
year     0
dtype: int64

In [22]:
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [27]:
# 전체 영화 수
titles.shape[0]

215981

In [46]:
# 가장 빠른 시기에 제작된 영화 2개
movie = titles.sort_values(by=["year"])
movie.head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [36]:
# "Hamlet"을 포함하는 영화는? 개수는?
hamlet = movie[movie['title'].str.contains('Hamlet')]

print(hamlet)
print("개수: ",hamlet.shape[0])

                                          title  year
43511                                    Hamlet  1910
195015                                   Hamlet  1911
154627                                   Hamlet  1913
67896                        A Sagebrush Hamlet  1919
91710                                    Hamlet  1921
92481                        Han, hun og Hamlet  1922
22416                        Han, hun og Hamlet  1932
5562                                     Hamlet  1948
68239                                    Hamlet  1954
211110                              Hamlet (II)  1964
169996                                   Hamlet  1964
114224                                   Hamlet  1969
205821                                   Hamlet  1973
95424       Predstava 'Hamleta' u Mrdusi Donjoj  1974
85741                                    Hamlet  1976
99031                              Kadin Hamlet  1977
106594                   Hamlet liikemaailmassa  1987
87781                                    Hamlet  1987
7105                  Hamlet: Prince of Denmark  1989
42224                                    Hamlet  1990
178758                             H for Hamlet  1993
13227                     Green Eggs and Hamlet  1995
141252                              Fuck Hamlet  1996
186988                                   Hamlet  1996
16132                 Hamlet, Prince of Denmark  1997
87971                                    Hamlet  2000
207847                   Hamlet in the Hamptons  2002
34513                                  Hamlet_X  2003
73720                                  Hamlet X  2004
175653                              Hamlet (II)  2005
4075            Dogg's Hamlet, Cahoot's Macbeth  2005
24984                               Hamlet (II)  2007
41595                              Hamlet (III)  2007
66269   The Tragedy of Hamlet Prince of Denmark  2007
160276                Hamlet the Vampire Slayer  2008
91272                                  Hamlet 2  2008
163645                                   Hamlet  2009
196411                           Kitchen Hamlet  2009
192815                                   Hamlet  2011
155984                            Zombie Hamlet  2012
14022                            Hamlet Unbound  2012
78024                       Harry, Hamlet and I  2013
62100                             Hamlet A.D.D.  2014
207793                                   Hamlet  2014
65478                            Hamlet's Ghost  2014
37373                                    Hamlet  2015
8227                                Hamlet (II)  2015
202788                             Hamlet (III)  2015
36465                  Hamlet, Son of a Kingpin  2015
115393            National Theatre Live: Hamlet  2015
108012                              Hamlet (II)  2016
33666             Hamlet: The Fall of a Sparrow  2016
26160                                    Hamlet  2016
12007              Hamlet (A Modern Adaptation)  2016
개수:  54

In [33]:
# 제목이 "Treasure Island"인 영화는? 개수는?
is_treasure = movie['title'] == 'Treasure Island'
tl = movie[is_treasure]
print(tl.sort_values(by=["year"]))
print("개수: ", tl.shape[0])

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999
개수:  8

In [47]:
is_movies = (movie['year'] >= 1950) & (movie['year'] <= 1959)
movies = movie[is_movies]
print(movies)
print("개수: ", movies.shape[0])

                                                    title  year
155736  A Ray of Sunshine: An Irresponsible Medley of ...  1950
57582                                  Min syster och jag  1950
35292                         Kees de zoon van de stroper  1950
156704                                Across the Badlands  1950
125696                                    La familia Vila  1950
35792                                      Bitter Springs  1950
40026                                 Zwei in einem Anzug  1950
153233                                   Kubanskie kazaki  1950
101530                                  Curvas peligrosas  1950
40390                                         Kontrabando  1950
193315                                      Atto d'accusa  1950
90445                                    Tapahtui kaukana  1950
102694                                What the Butler Saw  1950
162038                    Der Mann, der sich selber sucht  1950
156466                                       Sunset Blvd.  1950
59899                                           Shakedown  1950
102148                           La liga de las muchachas  1950
163823                                  Morning Departure  1950
60335                                La forza del destino  1950
38214                                        Dong Xiaowan  1950
100611                              The Fuller Brush Girl  1950
60279                                  Der fallende Stern  1950
82526                      Paramanandayya Shishyula Katha  1950
199441                                            Gunfire  1950
91996                                 Cronaca di un amore  1950
34691                                    Restaurant Intim  1950
100812                                        Barrio bajo  1950
127276                                 State Penitentiary  1950
56526                                           Marmolada  1950
10374                             The Flame and the Arrow  1950
...                                                   ...   ...
20388                             Juke box - Urli d'amore  1959
76868                                   Drillinge an Bord  1959
17803                                    Dum na Orechovce  1959
214614                                      Love Marriage  1959
149007                                 Thunder in the Sun  1959
153629                                      Kriegsgericht  1959
30465                               Bobby Dodd greift ein  1959
79259                           Watashi wa kai ni naritai  1959
109503                                           Annibale  1959
73837                                       Cerro Guanaco  1959
204837                                       Noci i jutra  1959
67561                        Freddy unter fremden Sternen  1959
27388                       San theli i nyfi kai o gabros  1959
87387                      Ipinagbili kami ng aming tatay  1959
198172                                  Visa pour l'enfer  1959
59788                                              Faisla  1959
115334                                     Gangster Story  1959
81568                                   Qian jin xiao jie  1959
32127                                           Black Cat  1959
137452                              La femme et le pantin  1959
109446                          In the Wake of a Stranger  1959
157439                                             Saathi  1959
134598                                        The Manster  1959
103220                                Kali Topi Lal Rumal  1959
66355                          Die Nacht vor der Premiere  1959
54006                                       Le petit prof  1959
77198                                            Maria 38  1959
7396                                  Witness in the Dark  1959
193215                               The Flying Fontaines  1959
78240                                        Les 90 Jours  1959

[12120 rows x 2 columns]
개수:  12120